master/cases/sydney/case.coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application dieselFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          2.5e-6;

writeControl    adjustableRunTime;

writeInterval   1e-3;

purgeWrite      50;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep   off;

maxCo            0.05;

maxDeltaT	1.0e-6;

functions 
(
   massFlow
   {
      type patchMassFlow;
      functionObjectLibs
       (
         "libsimpleFunctionObjects.so"
       );
     verbose true;
     patches
       (
         nozzle
         coflow
         outlet
       );
     factor 1.0;
   }


/*
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
             aC3H6O
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
             rho 
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

        );
    }
*/
);


// ************************************************************************* //
