master/cases/sydney/case.coarse/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry               off;

psiChemistryModel ODEChemistryModel<gasThermoPhysics>;

chemistrySolver         ode;
//chemistrySolver       EulerImplicit;
//chemistrySolver       sequential;

initialChemicalTimeStep     1.0e-7;

sequentialCoeffs
{
    cTauChem        1.0e-3;
}

EulerImplicitCoeffs
{
    cTauChem        5.0e-2;
    equilibriumRateLimiter      off;
}

odeCoeffs
{
    ODESolver       SIBS;
    eps             5.0e-2;
    scale           1.0;
}

// ************************************************************************* //
