master/cases/sydney/case.coarse/constant/injectorProperties
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.6                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          injectorProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
(

    {
        injectorType        myDefinedInjector;
        myDefinedInjectorProps
        {
            position        (0.001 0 0);
            direction       (1 0 0);
            diameter        0.015;
            Cd              1.0;
            mass            3.334e-5;
            nParcels        40000;
            temperature     280.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.2     1)
                (1.     1)
           );
            temperatureProfile 
            (
                (0.2     280.)
                (1.     280.)
           );
            velocityProfile 
            (
                (0.2     31.)
                (1.     31.)
           );
        }
    }
// ------------------------------------------------------------------------- 
)
