master/cases/sydney/case.coarse/constant/sprayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationSchemes
{
    U               cellPointFace;
    rho             cell;
    p               cell;
    pd               cell;
    T               cell;
}

subCycles       	2;
dtInjection		1e-9;

atomizationModel        off;
//atomizationModel      LISA;

includeOscillation      off;
//breakupModel    TAB;
//breakupModel    ETAB;
//breakupModel    ReitzDiwakar;
breakupModel    off;

//injectorModel         constInjector;
//injectorModel         ChomiakInjector;
//injectorModel         definedInjector;
//injectorModel         pressureSwirlInjector;
injectorModel           hollowConeInjector;

collisionModel  off;

//evaporationModel saturateEvaporationModel;
//evaporationModel standardEvaporationModel;
evaporationModel off;

//heatTransferModel RanzMarshall;
heatTransferModel off;

dispersionModel stochasticDispersionRAS;

dragModel       standardDragModel;

wallModel       reflect;

specConstAtomizationCoeffs
{
    dropletNozzleDiameterRatio
    (
        0.4
    );
    sprayAngle
    (
        10
    );
}

TABCoeffs
{
    y0              0.0;
    yDot0           0.0;
    Cmu             10.0;
    Comega          8.0;
    WeCrit          12;
}

ETABCoeffs
{
    Cmu         10.0;
    Comega      8.0;
    WeCrit      12;
    k1          0.2;
    k2          0.2;
    WeTransition    100.0;
}

ReitzDiwakarCoeffs
{
    Cbag            6;
    Cb              0.785;
    Cstrip          0.5;
    Cs              10;
}

ReitzKHRTCoeffs
{
    B0              0.61;
    B1              40;
    Ctau            1;
    CRT             0.1;
    msLimit         0.2;
    WeberLimit      6;
}

trajectoryCoeffs
{
    cSpace          1;
    cTime           0.3;
}

standardDragModelCoeffs
{
    preReFactor     0.166667;
    ReExponent      0.666667;
    ReLimiter       1000;
    CdLimiter       0.44;
    Cdistort        0;
}

standardEvaporationModelCoeffs
{
    evaporationScheme implicit;
    preReScFactor   0.6;
    ReExponent      0.5;
    ScExponent      0.333333;
}

RanzMarshallCoeffs
{
    preRePrFactor   0.6;
    ReExponent      0.5;
    PrExponent      0.333333;
}

hollowConeInjectorCoeffs
{
    dropletPDF
    {
        pdfType         lognormal;

	fixedValuePDF
	{
			value		13.7e-6;
	}

        lognormalPDF
        {
            minValue        	5.0e-6;
            maxValue    	60.0e-6;
	    expectation		18e-6;
	    variance		10e-6;
        }
		
	
	RosinRammlerPDF
        {
            minValue        3e-06;
            maxValue        50e-6;
            d               9.2e-6;
            n               1.2;
        }
    }

    innerConeAngle
    (
        0

    );

    outerConeAngle
    (
       15 

    );
}

reflectCoeffs
{
    elasticity      1.0;
}

// ************************************************************************* //
