master/cases/sydney/case.coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2200";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
5460
(
(29.5076 0.00266727 0)
(29.4935 0.00376476 -1.22166e-18)
(29.4626 0.0043773 -6.07149e-18)
(29.4245 0.00462008 -1.49666e-16)
(29.3854 0.00470408 -1.92423e-15)
(29.3458 0.00472142 -6.51925e-15)
(29.3053 0.00469728 -2.75157e-14)
(29.2643 0.00465782 -1.83947e-13)
...
)
;

boundaryField
{
    nozzle
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        value           nonuniform List<vector> 
12
(
(29.5258 0 0)
(29.4287 0 0)
(29.2341 0 0)
(28.933 0 0)
(28.5178 0 0)
(27.9712 0 0)
(27.2796 0 0)
(26.4036 0 0)
(25.2922 0 0)
(23.7997 0 0)
(21.6254 0 0)
(17.3453 0 0)
)
;
    }
    coflow
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }
    walls
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
