master/cases/sydney/case.coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0e5;


boundaryField
{
    nozzle
    {
        type            zeroGradient;
    }
    coflow
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value           uniform 1.0e5;
    }
    front
    {
        type            wedge;
    }
    back
    {
		type			wedge;
	}
    outlet
    {
        type            fixedValue;
        value           uniform 1.0e5;
    }
}


// ************************************************************************* //
