master/cases/sydney/case.coarse/0/aC3H6O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      aC3H6O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
    nozzle
    {
        type            fixedValue;
        value           uniform 0.0357;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0.;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0.;
    }
    front
    {
        type            wedge;
    }
    back
    {
		type			wedge;
	}
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
